app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @account = Account.find_by_id(params[:id])