app/controllers/accounts_controller.rb

  def index
    render json: Account.all
---
SELECT "accounts".* FROM "accounts"

  def create
    render json: Account.create(request.query_parameters)
---
INSERT INTO "accounts" ("name", "surname", "currency", "amount") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "a"], ["surname", "c"], ["currency", "USD"], ["amount", 330.0]]

  def show
    @account = Account.find_by_id(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    @account = Account.find_by_id(params[:id])
    if @account
      @account.update!(request.query_parameters)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "accounts" SET "amount" = $1 WHERE "accounts"."id" = $2  [["amount", 0.0], ["id", 3]]