app/controllers/payments_controller.rb

  def show
    render json: Payment.find(params[:id])
---
SELECT  "payments".* FROM "payments" WHERE "payments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]