app/controllers/payments_controller.rb

  def index
    respond_with(@payments = Payment.all)
---
SELECT "payments".* FROM "payments"

  def transfer
    @payment = Payment.new
    # resp = RestClient.get 'bank_service:8000/accounts', accept: :json
    @accounts = AccountsForPayment.new(accounts: Account.all).ids
---
SELECT "accounts"."id" FROM "accounts"