app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "abcdef"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(username: params[:username].to_s.downcase)